Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། གཞོན་ནུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཅི་ནས་ཀྱང་བདག་གིས་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་མངོན་སུམ་དུ་བྱ་བར་འདོད་དེ།
en: Then the Bhagavān said to the youth Candraprabha, “Young man, aspiring bodhisattva mahāsattvas think, ‘How can I make manifest the four discernments?

source: དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པ་འདི་བཞི་མངོན་སུམ་དུ་བྱའོ་སྙམ་ན། གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་ཏིང་ངེ་འཛིན་འདི་གཟུང་བར་བྱ། ཀུན་ཆུབ་པར་བྱ། བཅང་བར་བྱ།
en: They are the discernment of meaning, the discernment of phenomena, the discernment of definitions, and the discernment of eloquence.

source: བཀླག་པར་བྱ། རབ་ཏུ་གདོན་པར་བྱ། ལུང་མནོད་ཅིང་ཁ་ཏོན་དུ་བྱ། ཉོན་མོངས་པ་མེད་པར་བསྒོམ་པས་བསྒོམ་པར་བྱ། གཞན་ལ་ཡང་རྒྱ་ཆེར་རབ་ཏུ་བསྟན་པར་བྱ།
en: I shall manifest these four!’ On having this thought, young man, bodhisattva mahāsattvas should obtain this samādhi, understand it, preserve it, recite it to others, promote it, proclaim it, chant it, meditate on it with unadulterated meditation, and make it widely known to others.

source: བསྒོམ་པའི་རྣལ་འབྱོར་ལ་རྗེས་སུ་བརྩོན་པར་བྱའོ། །གཞོན་ནུ་དེ་ལ་ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པ་གང་ཞེ་ན།
en: “Young man, what is the discernment of phenomena?

source: གཞོན་ནུ་གཟུགས་སུ་བརྗོད་པ་ཇི་སྙེད་ཡོད་པ་གཞོན་ནུ་དེ་བཞིན་གཤེགས་པའི་བསྔགས་པ་བརྗོད་པ་ཡང་དེ་སྙེད་དོ། །དེ་བཞིན་དུ་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་རྣམས་ཇི་སྙེད་པ་དང་གཞོན་ནུ་རྣམ་པར་ཤེས་པའི་བརྗོད་པ་ཇི་སྙེད་པ་དེ་བཞིན་གཤེགས་པའི་བསྔགས་པ་བརྗོད་པ་ཡང་དེ་སྙེད་དེ།
en: “Young man, however many words there can be for forms, the tathāgata has that many appellations for them. It is the same for sensation, identification, mentation;

source: གཞོན་ནུ་དེ་ལྟར་གཟུགས་སུ་བརྗོད་པ་མཐའ་ཡས་མུ་མེད་བསམ་གྱིས་མི་ཁྱབ་པ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་བསྔགས་པ་བརྗོད་པ་ཡང་བསམ་གྱིས་མི་ཁྱབ་སྟེ།
en: and, young man, for consciousnesses. Young man, in that way there are infinite, endless, inconceivably numerous words for forms, and the tathāgata, too has inconceivably numerous appellations for them.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་རྣམས་དང་གཞོན་ནུ་འདི་ལྟར་རྣམ་པར་ཤེས་པའི་བརྗོད་པ་མཐའ་ཡས་མུ་མེད་དེ།
en: It is the same for sensation, identification, mentation, and, young man, for consciousnesses:

source: བསམ་གྱིས་མི་ཁྱབ་པ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་བསྔགས་པ་བརྗོད་པ་ཡང་བསམ་གྱིས་མི་ཁྱབ་པོ།
en: there are infinite, endless, inconceivably numerous words for them, and the tathāgata, too has inconceivably numerous appellations for them.

source: །གཞོན་ནུ་དེ་ལྟར་འདུས་བྱས་ལ་འང་ཉེས་པ་གྲངས་མེད།
en: “Young man, there are countless faults in those composite phenomena;

source: མྱ་ངན་ལས་འདས་པ་ལ་ཡང་ཕན་ཡོན་གྲངས་མེད་དེ། དེ་བཞིན་གཤེགས་པའི་བསྔགས་པ་ཡང་གྲངས་མེད་དོ།
en: there are also countless benefits in nirvāṇa, and the tathāgata, too, has that many countless appellations.

source: །གཞོན་ནུ་འདི་ལྟར་མྱ་ངན་ལས་འདས་པའི་མིང་ཇི་སྙེད་ཡོད་པའི་དེ་བཞིན་གཤེགས་པའི་བསྔགས་པ་ཡང་དེ་སྙེད་དོ།
en: Young man, as numerous as are the names for nirvāṇa, the tathāgata has that many appellations.

source: །གཞོན་ནུ་འདི་ལྟར་མྱ་ངན་འདས་པའི་མིང་གྲངས་མེད་དེ། དེ་བཞིན་གཤེགས་པའི་བསྔགས་པ་ཡང་གྲངས་མེད་དོ།
en: Thus, young man, there are countless names of nirvāṇa, and the tathāgata, too, has that many appellations.

source: །གཞོན་ནུ་འདི་བཞི་ནི་དེ་བཞིན་གཤེགས་པའི་བསྔགས་པ་བརྗོད་པ་བསམ་གྱིས་མི་ཁྱབ་པར་བརྗོད་པ་སྟེ། དེ་དག་མཐར་ཕྱིན་པའི་གནས་སུ་བསྟན་པར་སླ་བ་ནི་མ་ཡིན་ནོ།
en: “Young man, the tathāgata has spoken of four kinds of appellations that are inconceivably numerous because it is not easy to state that there is an end to them.

source: །བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these four?

source: འདུ་བྱེད་བརྗོད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་དབྱངས་བརྗོད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པ་བརྗོད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བ་བརྗོད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་སྟེ།
en: They are the inconceivably numerous appellations in regard to the composite, the inconceivably numerous appellations for sounds, the inconceivably numerous appellations for kleśas, and the inconceivably numerous appellations for purification.

source: གཞོན་ནུ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་བསྔགས་པ་བརྗོད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་བརྗོད་པ་བཞིའོ།
en: Young man, those are the tathāgata’s four kinds of inconceivably numerous appellations.

source: །གཞོན་ནུ་འདི་བཞི་ནི་དེ་བཞིན་གཤེགས་པའི་བརྗོད་པ་བསམ་གྱིས་མི་ཁྱབ་པ། བསམ་གྱིས་མི་ཁྱབ་པར་བསྟན་པ་སྟེ། དེ་དག་ནི་མཐར་ཕྱིན་པའི་གནས་སུ་བསྟན་པར་སླ་བ་མ་ཡིན་ནོ། །བཞི་གང་ཞེ་ན།
en: Young man, those four, the tathāgata’s inconceivably numerous appellations, are taught to be inconceivably numerous as it is not easy to state that there is an end to them.

source: བཞི་པོ་དེ་དག་ཉིད་དེ། དེ་བཞིན་དུ་རྒྱས་པར་བསྟན་པར་བྱའོ།
en: To understand what those four are, they should be taught in detail.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚུལ་བཞི་སྟེ།
en: “Young man, there are the four ways of the bodhisattvas.

source: བཞི་གང་ཞེ་ན།
en: What are the four ways?

source: འདུ་བྱེད་ཀྱི་ཚུལ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་ཚུལ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པའི་ཚུལ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་ཚུལ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous ways of the composite, the inconceivably numerous ways of teaching the composite, the inconceivably numerous ways of the kleśas, and the inconceivably numerous ways of purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རིགས་པ་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of reasoning. What are the four kinds of reasoning?

source: འདུ་བྱེད་ཀྱི་རིགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་རིགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པའི་རིགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་རིགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous kinds of reasoning concerning the composite, the inconceivably numerous kinds of reasoning concerning teaching the composite, the inconceivably numerous kinds of reasoning concerning the kleśas, and the inconceivably numerous kinds of reasoning concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྒོ་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of doorways. What are the four kinds of doorways?

source: འདུ་བྱེད་ཀྱི་སྒོ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་སྒོ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པའི་སྒོ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་སྒོ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous doorways concerning the composite, the inconceivably numerous doorways concerning teaching the composite, the inconceivably numerous doorways concerning the kleśas, and the inconceivably numerous doorways concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ངེས་པར་བསྟན་པ་བཞི་སྟེ།
en: “Young man, the bodhisattvas have four kinds of elucidation.

source: འདུ་བྱེད་ངེས་པར་བསྟན་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པ་ངེས་པར་བསྟན་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པའི་ངེས་པར་བསྟན་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བ་ངེས་པར་བསྟན་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous elucidations concerning the composite, the inconceivably numerous elucidations concerning teaching the composite, the inconceivably numerous elucidations concerning the kleśas, and the inconceivably numerous elucidations concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྒྲ་བཞི་སྟེ།
en: “Young man, the bodhisattvas have four kinds of speaking.

source: འདུ་བྱེད་ཀྱི་སྒྲ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་སྒྲ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པའི་སྒྲ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་སྒྲ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous kinds of speaking concerning the composite, the inconceivably numerous kinds of speaking concerning teaching the composite, the inconceivably numerous kinds of speaking concerning the kleśas, and the inconceivably numerous kinds of speaking concerning purification.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚིག་བཞི་སྟེ།
en: Those are the four. “Young man, the bodhisattvas have four kinds of words.

source: འདུ་བྱེད་ཀྱི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous words concerning the composite, the inconceivably numerous words concerning teaching the composite, the inconceivably numerous words concerning the kleśas, and the inconceivably numerous words concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚིག་གི་ལམ་བཞི་སྟེ།
en: “Young man, the bodhisattvas have four kinds of recitation.

source: འདུ་བྱེད་ཀྱི་ཚིག་གི་ལམ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་ཚིག་གི་ལམ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པའི་ཚིག་གི་ལམ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་ཚིག་གི་ལམ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous recitations concerning the composite, the inconceivably numerous recitations concerning teaching the composite, the inconceivably numerous recitations concerning the kleśas, and the inconceivably numerous recitations concerning purification.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དགོངས་ཏེ་བཤད་པ་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: Those are the four. “Young man, the bodhisattvas have four kinds of pertinent speech. What are the four kinds of pertinent speech?

source: འདུ་བྱེད་ཀྱི་དགོངས་ཏེ་བཤད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་དགོངས་ཏེ་བཤད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པའི་དགོངས་ཏེ་བཤད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་དགོངས་ཏེ་བཤད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous kinds of pertinent speech concerning the composite, the inconceivably numerous kinds of pertinent speech concerning teaching the composite, the inconceivably numerous kinds of pertinent speech concerning the kleśas, and the inconceivably numerous kinds of pertinent speech concerning purification.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལྷ་ལ་ངེས་པར་རྟོག་པ་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: Those are the four. “Young man, the bodhisattvas have four kinds of comprehension of the devas. What are the four kinds of comprehension of the devas?

source: འདུ་བྱེད་ལྷ་ལ་རྟོག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པ་ལྷ་ལ་རྟོག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པ་ལྷ་ལ་རྟོག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བ་ལྷ་ལ་རྟོག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous kinds of comprehension of the devas concerning the composite, the inconceivably numerous kinds of comprehension of the devas concerning teaching the composite, the inconceivably numerous kinds of comprehension of the devas concerning the kleśas, and the inconceivably numerous kinds of comprehension of the devas concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མི་ལ་རྟོག་པ་བཞི་སྟེ།
en: “Young man, the bodhisattvas have four kinds of comprehension of humans.

source: བཞི་གང་ཞེ་ན། འདུ་བྱེད་མི་ལ་རྟོག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པ་མི་ལ་རྟོག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པ་མི་ལ་རྟོག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བ་མི་ལ་རྟོག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: What are the four kinds of comprehension of humans? They are the inconceivably numerous kinds of comprehension of humans concerning the composite, the inconceivably numerous kinds of comprehension of humans concerning teaching the composite, the inconceivably numerous kinds of comprehension of humans concerning the kleśas, and the inconceivably numerous kinds of comprehension of humans concerning purification.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མིང་ལ་རྟོག་པ་བཞི་སྟེ།
en: Those are the four. “Young man, the bodhisattvas have four kinds of comprehension of names.

source: བཞི་གང་ཞེ་ན། འདུ་བྱེད་ཀྱི་མིང་ལ་རྟོག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་མིང་ལ་རྟོག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པའི་མིང་ལ་རྟོག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་མིང་ལ་རྟོག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: What are the four kinds of comprehension of names? They are the inconceivably numerous kinds of comprehension of names concerning the composite, the inconceivably numerous kinds of comprehension of names concerning teaching the composite, the inconceivably numerous kinds of comprehension of names concerning the kleśas, and the inconceivably numerous kinds of comprehension of names concerning purification.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་འཇུག་པ་བཞི་སྟེ།
en: Those are the four. “Young man, the bodhisattvas have four kinds of engagement.

source: འདུ་བྱེད་ལ་འཇུག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པ་ལ་འཇུག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པ་ལ་འཇུག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བ་ལ་འཇུག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous kinds of engagement concerning the composite, the inconceivably numerous kinds of engagement concerning teaching the composite, the inconceivably numerous kinds of engagement concerning the kleśas, and the inconceivably numerous kinds of engagement concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྒྲོལ་བ་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of ascension. What are the four kinds of ascension?

source: འདུ་བྱེད་ཀྱི་སྒྲོལ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་སྒྲོལ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པའི་སྒྲོལ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་སྒྲོལ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous kinds of ascension concerning the composite, the inconceivably numerous kinds of ascension concerning teaching the composite, the inconceivably numerous kinds of ascension concerning the kleśas, and the inconceivably numerous kinds of ascension concerning purification.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྡོ་རྗེའི་ཚིག་བཞི་སྟེ།
en: Those are the four. “Young man, the bodhisattvas have four kinds of vajra words.

source: བཞི་གང་ཞེ་ན། འདུ་བྱེད་ཀྱི་རྡོ་རྗེའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་རྡོ་རྗེའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པའི་རྡོ་རྗེའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་རྡོ་རྗེའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: What are the four kinds of vajra words? They are the inconceivably numerous vajra words concerning the composite, the inconceivably numerous vajra words concerning teaching the composite, the inconceivably numerous vajra words concerning the kleśas, and the inconceivably numerous vajra words concerning purification.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གསང་སྔགས་ཀྱི་ཚིག་བཞི་སྟེ།
en: Those are the four. “Young man, the bodhisattvas have four kinds of mantra words.

source: འདུ་བྱེད་གསང་སྔགས་ཀྱི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པ་གསང་སྔགས་ཀྱི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པའི་གསང་སྔགས་ཀྱི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་གསང་སྔགས་ཀྱི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous mantra words concerning the composite, the inconceivably numerous mantra words concerning teaching the composite, the inconceivably numerous mantra words concerning the kleśas, and the inconceivably numerous mantra words concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྒྲུབ་པ་བཞི་སྟེ།
en: “Young man, the bodhisattvas have four kinds of attainment.

source: འདུ་བྱེད་སྒྲུབ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པ་སྒྲུབ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པ་སྒྲུབ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བ་སྒྲུབ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous attainments concerning the composite, the inconceivably numerous attainments concerning teaching the composite, the inconceivably numerous attainments concerning the kleśas, and the inconceivably numerous attainments concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མདོ་སྡེའི་ཚིག་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of sūtra words. What are the four kinds of sūtra words?

source: འདུ་བྱེད་མདོ་སྡེའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པ་མདོ་སྡེའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པ་མདོ་སྡེའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བ་མདོ་སྡེའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous sūtra words concerning the composite, the inconceivably numerous sūtra words concerning teaching the composite, the inconceivably numerous sūtra words concerning the kleśas, and the inconceivably numerous sūtra words concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བཏགས་པའི་ཚིག་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of designations. What are the four kinds of designations?

source: འདུ་བྱེད་བཏགས་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པ་བཏགས་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པ་བཏགས་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བ་བཏགས་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous designations concerning the composite, the inconceivably numerous designations concerning teaching the composite, the inconceivably numerous designations concerning the kleśas, and the inconceivably numerous designations concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྣང་བའི་ཚིག་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of words concerning illumination. What are the four kinds of words concerning illumination?

source: འདུ་བྱེད་སྣང་བའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པ་སྣང་བའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པ་སྣང་བའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བ་སྣང་བའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous words concerning illumination in regard to the composite, the inconceivably numerous words concerning illumination in regard to teaching the composite, the inconceivably numerous words concerning illumination in regard to the kleśas, and the inconceivably numerous words concerning illumination in regard to purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གསལ་བའི་ཚིག་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of words concerning clarification. What are the four kinds of words concerning clarification?

source: འདུ་བྱེད་གསལ་བའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པ་གསལ་བའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པ་གསལ་བའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བ་གསལ་བའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous words concerning clarification in regard to the composite, the inconceivably numerous words concerning clarification in regard to teaching the composite, the inconceivably numerous words concerning clarification in regard to the kleśas, and the inconceivably numerous words of clarification in regard to purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱོད་པའི་ཚིག་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of words concerning conduct. What are the four kinds of words concerning conduct?

source: འདུ་བྱེད་ཀྱི་སྤྱོད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པ་སྤྱོད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པ་སྤྱོད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བ་སྤྱོད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous words of conduct concerning the composite, the inconceivably numerous words of conduct concerning teaching the composite, the inconceivably numerous words of conduct concerning the kleśas, and the inconceivably numerous words of conduct concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱད་པའི་ཚིག་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of words concerning behavior. What are the four kinds of words concerning behavior?

source: འདུ་བྱེད་ཀྱི་སྤྱད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པ་སྤྱད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པ་སྤྱད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བ་སྤྱད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous kinds of words concerning behavior in regard to the composite, the inconceivably numerous kinds of words concerning behavior in regard to teaching the composite, the inconceivably numerous kinds of words concerning behavior in regard to the kleśas, and the inconceivably numerous kinds of words concerning behavior in regard to purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་གྱིས་མི་ཁྱབ་པའི་ཚིག་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of words of inconceivability. What are the four kinds of words of inconceivability?

source: འདུ་བྱེད་བསམ་གྱིས་མི་ཁྱབ་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous words of inconceivability concerning the composite, the inconceivably numerous words of inconceivability concerning teaching the composite, the inconceivably numerous words of inconceivability concerning the kleśas, and the inconceivably numerous words of inconceivability concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མཐའ་ཡས་པའི་ཚིག་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of words of limitlessness. What are the four kinds of words of limitlessness?

source: འདུ་བྱེད་མཐའ་ཡས་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པ་མཐའ་ཡས་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པ་མཐའ་ཡས་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བ་མཐའ་ཡས་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous words of limitlessness concerning the composite, the inconceivably numerous words of limitlessness concerning teaching the composite, the inconceivably numerous words of limitlessness concerning the kleśas, and the inconceivably numerous words of limitlessness concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྒྱུ་བ་མེད་པའི་ཚིག་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of words of nonmovement. What are the four kinds of words of nonmovement?

source: འདུ་བྱེད་རྒྱུ་བ་མེད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པ་རྒྱུ་བ་མེད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པའི་རྒྱུ་བ་མེད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བ་རྒྱུ་བ་མེད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous words of nonmovement concerning the composite, the inconceivably numerous words of nonmovement concerning teaching the composite, the inconceivably numerous words of nonmovement concerning the kleśas, and the inconceivably numerous words of nonmovement concerning purification.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མུ་མེད་པའི་ཚིག་བཞི་སྟེ།
en: Those are the four. “Young man, the bodhisattvas have four kinds of words of boundlessness.
